app/views/app/profile.html.erb

SELECT "users".* FROM "users" WHERE "users"."uid" = 3 LIMIT 1
---
<%u = Auth.user %>
  <% result=User.where(uid: u.id).take %>

SELECT "ownachievements".* FROM "ownachievements" WHERE "ownachievements"."user_id" = ?  [["user_id", 3]]
SELECT COUNT(*) FROM "ownachievements" WHERE "ownachievements"."user_id" = 3
---

<% acount=Ownachievement.where(user_id: u.id).count %>

SELECT "servers".* FROM "servers" WHERE "servers"."user_id" = ?  [["user_id", 3]]
SELECT COUNT(*) FROM "servers" WHERE "servers"."user_id" = 3
---
margin-left: 20px;">
<%servercount= Server.where(user_id: u.id).count %>

SELECT "projs".* FROM "projs" WHERE "projs"."server_id" = ?  [["server_id", 1]]
SELECT COUNT(*) FROM "projs" WHERE "projs"."server_id" = 1
---
<% for i in 0..(servercount-1) %>
<%=i+1%><%= " Server name:"%><%projectcount= Proj.where(server_id: s[i][:sid].inspect).count %>