app/controllers/app_controller.rb

	def profiledata

			u = Auth.user
			user = User.find_by(uid: u.id)
			user.pass = params[:post][:newpassword]
			if user.save
---
SELECT "users".* FROM "users" WHERE "users"."uid" = 3 LIMIT 1
UPDATE "users" SET "pass" = ?, "updated_at" = ? WHERE "users"."uid" = 3  [["pass", "075224350"], ["updated_at", Sat, 01 Feb 2014 12:33:15 UTC +00:00]]