app/controllers/authen_controller.rb

	def signupdata


			#render text: params[:post].inspect
			user_new = User.new
			user_new[:email]=params[:post][:username]
			user_new[:pass]=params[:post][:password]

			if user_new.save
---
INSERT INTO "users" ("created_at", "email", "pass", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Thu, 30 Jan 2014 09:59:43 UTC +00:00], ["email", "test1@gmail.com"], ["pass", "075224350"], ["updated_at", Thu, 30 Jan 2014 09:59:43 UTC +00:00]]